Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker table.

In [ ]:
SELECT
    SUBSTRING (FIRST_NAME, 1, 3)
FROM
    Worker;

 Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name column ‘Amitabh’ from Worker table.

In [ ]:
SELECT
    POSITION ('a' IN FIRST_NAME)
FROM
    Worker
WHERE
    FIRST_NAME = 'Amitabh';

Q-3. Write an SQL query to print the name of employees having the highest salary in each department.

In [ ]:
SELECT 
    first_name, last_name, MAX(salary), department 
FROM 
    Worker
GROUP BY
    DEPARTMENNT;